backend/app/controllers/api/player_season_stats_controller.rb

SELECT "player_season_stats".* FROM "player_season_stats" ORDER BY "player_season_stats"."season" ASC, "player_season_stats"."id" ASC
---
    def index
      player_season_stats = PlayerSeasonStat.includes(:player, :stat_type).order(:season, :id)

INSERT INTO "player_season_stats" ("player_id", "stat_type_id", "season", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["player_id", 12], ["stat_type_id", 8], ["season", 2025], ["value", "4.7"], ["created_at", "2026-06-06 06:36:07.357708"], ["updated_at", "2026-06-06 06:36:07.357708"]]
---
    def create
      player_season_stat = PlayerSeasonStat.new(player_season_stat_params)

      if player_season_stat.save

UPDATE "player_season_stats" SET "value" = $1, "updated_at" = $2 WHERE "player_season_stats"."id" = $3  [["value", "5.1"], ["updated_at", "2026-06-06 06:36:07.368443"], ["id", 7]]
---
    def update
      if @player_season_stat.update(player_season_stat_params)

DELETE FROM "player_season_stats" WHERE "player_season_stats"."id" = $1  [["id", 8]]
---
    def destroy
      @player_season_stat.destroy

SELECT "player_season_stats".* FROM "player_season_stats" WHERE "player_season_stats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_player_season_stat
      @player_season_stat = PlayerSeasonStat.find(params[:id])